Documents/КорректировкаЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>КорректировкаЗадолженности</Name>
			<BasedOn>
				<xr:Item>Document.НачислениеЗадолженности</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляКорректировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВходящегоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОтмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОснованиеДо</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПосле</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СодержаниеДо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СодержаниеПосле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплатыДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплатыПосле</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумагаДо</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумагаПосле</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СубъектыАналитики</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДо</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПосле</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСДо</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСПосле</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСДо</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСПосле</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйИнвестиционныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиАкционерныхИнвестиционныхФондов</Name>
					<Comment>Управление активами АИФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПаевогоИнвестиционногоФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФизическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФОГФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеИмуществомСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиНакоплениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиРезервами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеРезервамиСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеСобственнымиСредствамиПенсионныхФондов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЦелевыхКапиталов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СчетФактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СчетФактура</Name>
			<BasedOn>
				<xr:Item>Document.Оплата</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетовФактур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактурыПолученного</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КорректировкаЗадолженности/Ext/ManagerModule.bsl
Процедура ПодготовитьДанныеПроведения(ДокументСсылка, Запрос, ТипЗадолженности, ДанныеДокумента, ВестиУчетНДС) Экспорт
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА КорректировкаЗадолженностиОснования.ОснованиеДо <> НЕОПРЕДЕЛЕНО
		|			ТОГДА КорректировкаЗадолженностиОснования.ОснованиеДо
		|		ИНАЧЕ КорректировкаЗадолженностиОснования.Ссылка.ОснованиеДляКорректировки
		|	КОНЕЦ КАК ОснованиеДо,
		|	ВЫБОР
		|		КОГДА КорректировкаЗадолженностиОснования.ОснованиеПосле <> НЕОПРЕДЕЛЕНО
		|			ТОГДА КорректировкаЗадолженностиОснования.ОснованиеПосле
		|		ИНАЧЕ КорректировкаЗадолженностиОснования.Ссылка.ОснованиеДляКорректировки
		|	КОНЕЦ КАК ОснованиеПосле,
		|	КорректировкаЗадолженностиОснования.ДатаОплатыДо КАК ДатаОплатыДо,
		|	КорректировкаЗадолженностиОснования.ДатаОплатыПосле КАК ДатаОплатыПосле,
		|	СУММА(КорректировкаЗадолженностиОснования.СуммаДо) КАК СуммаДо,
		|	СУММА(КорректировкаЗадолженностиОснования.СуммаПосле) КАК СуммаПосле,
		|	КорректировкаЗадолженностиОснования.СтавкаНДСДо КАК СтавкаНДСДо,
		|	КорректировкаЗадолженностиОснования.СтавкаНДСПосле КАК СтавкаНДСПосле,
		|	СУММА(КорректировкаЗадолженностиОснования.СуммаНДСДо) КАК СуммаНДСДо,
		|	СУММА(КорректировкаЗадолженностиОснования.СуммаНДСПосле) КАК СуммаНДСПосле,
		|	ВЫБОР
		|		КОГДА КорректировкаЗадолженностиОснования.СуммаДо < КорректировкаЗадолженностиОснования.СуммаПосле
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоУвеличение,
		|	КорректировкаЗадолженностиОснования.ЦеннаяБумагаДо КАК ЦеннаяБумагаДо,
		|	КорректировкаЗадолженностиОснования.ЦеннаяБумагаПосле КАК ЦеннаяБумагаПосле
		|ПОМЕСТИТЬ _ПоДокументу
		|ИЗ
		|	Документ.КорректировкаЗадолженности.Основания КАК КорректировкаЗадолженностиОснования
		|ГДЕ
		|	КорректировкаЗадолженностиОснования.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаЗадолженностиОснования.ОснованиеПосле,
		|	КорректировкаЗадолженностиОснования.ДатаОплатыДо,
		|	КорректировкаЗадолженностиОснования.ДатаОплатыПосле,
		|	КорректировкаЗадолженностиОснования.СтавкаНДСДо,
		|	КорректировкаЗадолженностиОснования.СтавкаНДСПосле,
		|	ВЫБОР
		|		КОГДА КорректировкаЗадолженностиОснования.СуммаДо < КорректировкаЗадолженностиОснования.СуммаПосле
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА КорректировкаЗадолженностиОснования.ОснованиеДо <> НЕОПРЕДЕЛЕНО
		|			ТОГДА КорректировкаЗадолженностиОснования.ОснованиеДо
		|		ИНАЧЕ КорректировкаЗадолженностиОснования.Ссылка.ОснованиеДляКорректировки
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА КорректировкаЗадолженностиОснования.ОснованиеПосле <> НЕОПРЕДЕЛЕНО
		|			ТОГДА КорректировкаЗадолженностиОснования.ОснованиеПосле
		|		ИНАЧЕ КорректировкаЗадолженностиОснования.Ссылка.ОснованиеДляКорректировки
		|	КОНЕЦ,
		|	КорректировкаЗадолженностиОснования.ЦеннаяБумагаДо,
		|	КорректировкаЗадолженностиОснования.ЦеннаяБумагаПосле
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоДокументу.ОснованиеДо КАК ОснованиеДо,
		|	-СУММА(ВЫБОР
		|			КОГДА _ПоДокументу.ОснованиеДо = _ПоДокументу.ОснованиеПосле
		|				ТОГДА _ПоДокументу.СуммаПосле - _ПоДокументу.СуммаДо
		|			ИНАЧЕ -_ПоДокументу.СуммаДо
		|		КОНЕЦ) КАК СуммаУменьшения,
		|	СУММА(_ПоДокументу.СуммаДо) КАК СуммаНачальная
		|ПОМЕСТИТЬ _УменьшениеСуммы
		|ИЗ
		|	_ПоДокументу КАК _ПоДокументу
		|ГДЕ
		|	НЕ _ПоДокументу.ЭтоУвеличение
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоДокументу.ОснованиеДо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Оплачено.ОснованиеДо КАК ОснованиеДо,
		|	СУММА(_Оплачено.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _Оплачено
		|ИЗ
		|	(ВЫБРАТЬ
		|		_УменьшениеСуммы.ОснованиеДо КАК ОснованиеДо,
		|		ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма
		|	ИЗ
		|		_УменьшениеСуммы КАК _УменьшениеСуммы
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|			ПО _УменьшениеСуммы.ОснованиеДо = ЗадолженностиПоДенежнымСредствам.Основание
		|				И (ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = &ВидЗадолженности)
		|				И (ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|				И (ЗадолженностиПоДенежнымСредствам.Сумма > 0)
		|				И (НЕ ЗадолженностиПоДенежнымСредствам.Аванс)
		|				И (ЗадолженностиПоДенежнымСредствам.Период < &Дата)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_УменьшениеСуммы.ОснованиеДо,
		|		ЗадолженностиПоДенежнымСредствам.Сумма
		|	ИЗ
		|		_УменьшениеСуммы КАК _УменьшениеСуммы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|			ПО _УменьшениеСуммы.ОснованиеДо = ЗадолженностиПоДенежнымСредствам.Регистратор
		|				И (ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|				И (ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = &ВидЗадолженности)
		|				И (ЗадолженностиПоДенежнымСредствам.Аванс)
		|				И (ЗадолженностиПоДенежнымСредствам.Сумма > 0)
		|				И (ЗадолженностиПоДенежнымСредствам.Период < &Дата)) КАК _Оплачено
		|
		|СГРУППИРОВАТЬ ПО
		|	_Оплачено.ОснованиеДо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _ОстаткиЗадолженностиНДС
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&ДоДокумента,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоПриобретеннымЦенностям)
		|				И Валюта = &Валюта
		|				И Основание = &ОснованиеДляКорректировки) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|ГДЕ
		|	&ВестиУчетНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УменьшениеСуммы.ОснованиеДо КАК ОснованиеДо,
		|	_Оплачено.Сумма - (_УменьшениеСуммы.СуммаНачальная - _УменьшениеСуммы.СуммаУменьшения) КАК Сумма
		|ПОМЕСТИТЬ _ВозникновениеАвансов
		|ИЗ
		|	_УменьшениеСуммы КАК _УменьшениеСуммы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Оплачено КАК _Оплачено
		|		ПО _УменьшениеСуммы.ОснованиеДо = _Оплачено.ОснованиеДо
		|ГДЕ
		|	_Оплачено.Сумма - (_УменьшениеСуммы.СуммаНачальная - _УменьшениеСуммы.СуммаУменьшения) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Аванс КАК Аванс,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ _ОстаткиЗадолженностиБезНДС
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&ДоДокумента,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = &ВидЗадолженности
		|				И Контрагент = &Контрагент
		|				И Валюта = &Валюта
		|				И (ЕСТЬNULL(ВЫРАЗИТЬ(Основание КАК Документ.НачислениеЗадолженности).Договор, НЕОПРЕДЕЛЕНО) = &Договор
		|					ИЛИ ЕСТЬNULL(ВЫРАЗИТЬ(Основание КАК Документ.Оплата).Договор, НЕОПРЕДЕЛЕНО) = &Договор)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|ГДЕ
		|	&ЗачестьАвансы
		|	И ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.НачислениеЗадолженности
		|				ТОГДА НЕ ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.НачислениеЗадолженности).Предварительно
		|			КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.Оплата
		|				ТОГДА НЕ ВЫРАЗИТЬ(ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Документ.Оплата).ОбеспечительныйПлатеж
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Ссылка,
		|	ВЫБОР
		|		КОГДА &ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|	КОНЕЦ,
		|	&ВидЗадолженности,
		|	ИСТИНА,
		|	_ВозникновениеАвансов.Сумма
		|ИЗ
		|	_ВозникновениеАвансов КАК _ВозникновениеАвансов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ПоДокументу.ОснованиеПосле,
		|	&ТипЗадолженности,
		|	&ВидЗадолженности,
		|	ЛОЖЬ,
		|	_ПоДокументу.СуммаПосле - _ПоДокументу.СуммаДо
		|ИЗ
		|	_ПоДокументу КАК _ПоДокументу
		|ГДЕ
		|	_ПоДокументу.ЭтоУвеличение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЗадолженностиБезНДС.Основание КАК Основание,
		|	_ОстаткиЗадолженностиБезНДС.ТипЗадолженности КАК ТипЗадолженности,
		|	_ОстаткиЗадолженностиБезНДС.ВидЗадолженности КАК ВидЗадолженности,
		|	_ОстаткиЗадолженностиБезНДС.Аванс КАК Аванс,
		|	_ОстаткиЗадолженностиБезНДС.СуммаОстаток КАК СуммаОстаток,
		|	ЕСТЬNULL(СчетФактураОснования.СуммаСНДС, 0) КАК АвансовыйСчФСуммаСНДС,
		|	ЕСТЬNULL(СчетФактураОснования.СуммаНДС, 0) КАК АвансовыйСчФСуммаНДС,
		|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0) КАК АвансовыйНДССуммаОстаток,
		|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.Основание, НЕОПРЕДЕЛЕНО) КАК АвансовыйСчетФактура
		|ПОМЕСТИТЬ _ОстаткиЗадолженности
		|ИЗ
		|	_ОстаткиЗадолженностиБезНДС КАК _ОстаткиЗадолженностиБезНДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактура.Основания КАК СчетФактураОснования
		|		ПО _ОстаткиЗадолженностиБезНДС.Основание = СчетФактураОснования.Основание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|				&ДоДокумента,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоАвансам)) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ПО (СчетФактураОснования.Ссылка = ЗадолженностиПоДенежнымСредствамОстатки.Основание)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоДокументу.ОснованиеДо КАК ОснованиеДо,
		|	_ПоДокументу.ЭтоУвеличение КАК ЭтоУвеличение,
		|	СУММА(_ПоДокументу.СуммаНДСПосле - _ПоДокументу.СуммаНДСДо) КАК ДельтаСуммаНДС,
		|	_ПоДокументу.СтавкаНДСПосле КАК СтавкаНДС
		|ПОМЕСТИТЬ _ИзменениеНДС
		|ИЗ
		|	_ПоДокументу КАК _ПоДокументу
		|ГДЕ
		|	_ПоДокументу.СуммаНДСПосле <> _ПоДокументу.СуммаНДСДо
		|	И _ПоДокументу.ОснованиеДо = &ОснованиеДляКорректировки
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоДокументу.ОснованиеДо,
		|	_ПоДокументу.ЭтоУвеличение,
		|	_ПоДокументу.СтавкаНДСПосле";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВидЗадолженности", ДанныеДокумента.ВидЗадолженности);
	Запрос.УстановитьПараметр("ТипЗадолженности", ТипЗадолженности);
	Запрос.УстановитьПараметр("Организация", ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ДокументСсылка.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Валюта", ДанныеДокумента.Валюта);
	Запрос.УстановитьПараметр("Контрагент", ДокументСсылка.Контрагент);
	Запрос.УстановитьПараметр("Договор", ДокументСсылка.Договор);
	Запрос.УстановитьПараметр("Дата", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("ОснованиеДляКорректировки", ДокументСсылка.ОснованиеДляКорректировки);
	Запрос.УстановитьПараметр("ДоДокумента", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ЗачестьАвансы", Истина);//предполагается что понадобится флаг в документе
	Запрос.УстановитьПараметр("ИФНС", РегистрыСведений.ИФНСОрганизаций.ПолучитьИФНС(ДокументСсылка.Дата, ДокументСсылка.Организация, Истина));
	Запрос.УстановитьПараметр("ВестиУчетНДС", ВестиУчетНДС);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПодготовитьТаблицуЗачетаАвансов(Запрос) Экспорт
	
	ТаблицаЗачетов = Новый ТаблицаЗначений;
	ТаблицаЗачетов.Колонки.Добавить("ДокументЗадолженности", Метаданные.ОпределяемыеТипы.ОснованиеЗадолженностиПоДенежнымСредствам.Тип);
	ТаблицаЗачетов.Колонки.Добавить("ДокументОплаты", Метаданные.ОпределяемыеТипы.ОснованиеЗадолженностиПоДенежнымСредствам.Тип);
	ТаблицаЗачетов.Колонки.Добавить("ДокументАвансовыйСчетФактура", Новый ОписаниеТипов("ДокументСсылка.СчетФактура"));
	ТаблицаЗачетов.Колонки.Добавить("Сумма", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);     
	ТаблицаЗачетов.Колонки.Добавить("СуммаНДС", Метаданные.ОпределяемыеТипы.ДенежныеСуммы.Тип);     
	
	//зачет задолженностей
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиЗадолженности.Основание КАК Основание,
		|	_ОстаткиЗадолженности.ТипЗадолженности КАК ТипЗадолженности,
		|	_ОстаткиЗадолженности.Аванс КАК Аванс,
		|	_ОстаткиЗадолженности.АвансовыйСчетФактура КАК АвансовыйСчетФактура,
		|	СУММА(_ОстаткиЗадолженности.СуммаОстаток) КАК СуммаОстаток,
		|	_ОстаткиЗадолженности.АвансовыйСчФСуммаСНДС КАК АвансовыйСчФСуммаСНДС,
		|	_ОстаткиЗадолженности.АвансовыйСчФСуммаНДС КАК АвансовыйСчФСуммаНДС,
		|	_ОстаткиЗадолженности.АвансовыйНДССуммаОстаток КАК АвансовыйНДССуммаОстаток
		|ИЗ
		|	_ОстаткиЗадолженности КАК _ОстаткиЗадолженности
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОстаткиЗадолженности.Основание,
		|	_ОстаткиЗадолженности.ТипЗадолженности,
		|	_ОстаткиЗадолженности.Аванс,
		|	_ОстаткиЗадолженности.АвансовыйСчетФактура,
		|	_ОстаткиЗадолженности.АвансовыйСчФСуммаСНДС,
		|	_ОстаткиЗадолженности.АвансовыйСчФСуммаНДС,
		|	_ОстаткиЗадолженности.АвансовыйНДССуммаОстаток,
		|	_ОстаткиЗадолженности.Основание.МоментВремени
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ОстаткиЗадолженности.Основание.МоментВремени";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	БазовыйТипЗадолженности = Запрос.Параметры.ТипЗадолженности;
	ТипЗадолженностиКЗачету = ?(БазовыйТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская, Перечисления.ТипыЗадолженности.Кредиторская, Перечисления.ТипыЗадолженности.Дебиторская);
	ТаблицаЗадолженностей = РезультатЗапроса.Выгрузить();
	
	СтрокиЗадолженности = ТаблицаЗадолженностей.НайтиСтроки(Новый Структура("ТипЗадолженности", БазовыйТипЗадолженности));

	Пока СтрокиЗадолженности.Количество() > 0  Цикл
		
		ТекущаяСтрока = СтрокиЗадолженности.Получить(0);
		ТипЗадолженностиКЗачету = ?(ТекущаяСтрока.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская, Перечисления.ТипыЗадолженности.Кредиторская, Перечисления.ТипыЗадолженности.Дебиторская);
		СтрокиКЗачету = ТаблицаЗадолженностей.НайтиСтроки(Новый Структура("ТипЗадолженности", ТипЗадолженностиКЗачету));
		Если СтрокиКЗачету.Количество() > 0  Тогда
			Для Каждого СтрокаЗачета из СтрокиКЗачету Цикл
				
				СуммаЗачета = Мин(ТекущаяСтрока.СуммаОстаток, СтрокаЗачета.СуммаОстаток);
				
				Если Не ЗначениеЗаполнено(СтрокаЗачета.АвансовыйСчетФактура) Тогда
					СуммаЗачетаНДС = 0;
				ИначеЕсли СуммаЗачета = СтрокаЗачета.СуммаОстаток Тогда
					СуммаЗачетаНДС = СтрокаЗачета.АвансовыйНДССуммаОстаток;
				Иначе
					СуммаЗачетаНДС = Окр(СуммаЗачета * СтрокаЗачета.АвансовыйСчФСуммаНДС / СтрокаЗачета.АвансовыйСчФСуммаСНДС, 2);
				КонецЕсли;
				
				СтрокаЗачетаВТаблице = ТаблицаЗачетов.Добавить();
				СтрокаЗачетаВТаблице.ДокументЗадолженности = ТекущаяСтрока.Основание;
				СтрокаЗачетаВТаблице.ДокументОплаты = СтрокаЗачета.Основание;
				СтрокаЗачетаВТаблице.ДокументАвансовыйСчетФактура = СтрокаЗачета.АвансовыйСчетФактура;
				СтрокаЗачетаВТаблице.Сумма = СуммаЗачета;
				СтрокаЗачетаВТаблице.СуммаНДС = СуммаЗачетаНДС;
				
				//остатки в таблицах
				СтрокаЗачета.СуммаОстаток = СтрокаЗачета.СуммаОстаток - СуммаЗачета;
				СтрокаЗачета.АвансовыйНДССуммаОстаток = СтрокаЗачета.АвансовыйНДССуммаОстаток - СуммаЗачетаНДС;
				Если СтрокаЗачета.СуммаОстаток = 0 Тогда
					ТаблицаЗадолженностей.Удалить(СтрокаЗачета);
				КонецЕсли;
				ТекущаяСтрока.СуммаОстаток = ТекущаяСтрока.СуммаОстаток - СуммаЗачета;
				Если ТекущаяСтрока.СуммаОстаток = 0 Тогда
					Прервать;
				КонецЕсли;
					
			КонецЦикла;
		Иначе
			//нет встречных задолженностей
			Прервать;
		КонецЕсли;
		
		Если ТекущаяСтрока.СуммаОстаток = 0 Тогда
			СтрокиЗадолженности.Удалить(0);
			ТаблицаЗадолженностей.Удалить(ТекущаяСтрока);
		Иначе
			//больше нет оплат, зачитывать не с чем
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаЗачетов;
	
КонецФункции

Функция ПолучитьТаблицуОснований(ДокументСсылка)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаЗадолженностиОснования.Ссылка КАК Ссылка,
	|	КорректировкаЗадолженностиОснования.НомерСтроки КАК НомерСтроки,
	|	КорректировкаЗадолженностиОснования.ОснованиеДо КАК ОснованиеДо,
	|	КорректировкаЗадолженностиОснования.ОснованиеПосле КАК ОснованиеПосле,
	|	КорректировкаЗадолженностиОснования.СодержаниеДо КАК СодержаниеДо,
	|	КорректировкаЗадолженностиОснования.СодержаниеПосле КАК СодержаниеПосле,
	|	КорректировкаЗадолженностиОснования.ДатаОплатыДо КАК ДатаОплатыДо,
	|	КорректировкаЗадолженностиОснования.ДатаОплатыПосле КАК ДатаОплатыПосле,
	|	КорректировкаЗадолженностиОснования.ЦеннаяБумагаДо КАК ЦеннаяБумагаДо,
	|	КорректировкаЗадолженностиОснования.ЦеннаяБумагаПосле КАК ЦеннаяБумагаПосле,
	|	КорректировкаЗадолженностиОснования.СуммаДо КАК СуммаДо,
	|	КорректировкаЗадолженностиОснования.СуммаПосле КАК СуммаПосле,
	|	КорректировкаЗадолженностиОснования.СтавкаНДСДо КАК СтавкаНДСДо,
	|	КорректировкаЗадолженностиОснования.СтавкаНДСПосле КАК СтавкаНДСПосле,
	|	КорректировкаЗадолженностиОснования.СуммаНДСДо КАК СуммаНДСДо,
	|	КорректировкаЗадолженностиОснования.СуммаНДСПосле КАК СуммаНДСПосле
	|ИЗ
	|	Документ.КорректировкаЗадолженности.Основания КАК КорректировкаЗадолженностиОснования
	|ГДЕ
	|	КорректировкаЗадолженностиОснования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция ПодготовитьНаборПроводок(ДокументСсылка, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления = Ложь) Экспорт
		
	Движения = РегистрыБухгалтерии[УчетныйРегистр].СоздатьНаборЗаписей();
	
	Если Не ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаЗадолженности") Тогда
		Возврат Движения;
	КонецЕсли;
	
	МетодОпределенияДоходовИРасходов = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		Дата, 
		Организация, 
		СчетДоверительногоУправления,
		УчетныйРегистр,
		"МетодОпределенияДоходовИРасходов");
		
	Если Не ЗначениеЗаполнено(МетодОпределенияДоходовИРасходов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках по виду учета " + УчетныйРегистр + " не указан метод определения доходов и расходов. Документ не проведен по виду учета!", ДокументСсылка,,,Отказ);
		Возврат Движения;
	КонецЕсли;	
	
	ВестиУчетНДС = РаботаСНДС.ВестиУчетНДС(Дата, Организация, СчетДоверительногоУправления);
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Контрагент, Договор, ОснованиеДляКорректировки");
	Контрагент 					 = ДанныеДокумента.Контрагент;
	Договор 					 = ДанныеДокумента.Договор;
	ОснованиеДляКорректировки	 = ДанныеДокумента.ОснованиеДляКорректировки;
		
	ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеДляКорректировки, "Валюта, ПрочиеДоходыИРасходы, ВидЗадолженности, РасчетныйСчет, НДСПоОбщимРасходам, ЗачестьНДС, НДСВключатьВСтоимость, Дата");
	Валюта 				 = ДанныеОснования.Валюта;
	ПрочиеДоходыИРасходы = ДанныеОснования.ПрочиеДоходыИРасходы;
	
	ОтражатьУменьшениеОбратнойПроводкой = 
		СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда
		И НачалоМесяца(ДанныеОснования.Дата) <> НачалоМесяца(Дата);
	
	Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего Тогда
		ДоговорДляПроводок = СчетДоверительногоУправления;
	ИначеЕсли ВидЗадолженности.Родитель = Справочники.ВидыЗадолженности.БанковскаяКомиссия Тогда
		//проводки делает оплата
		Возврат Движения;
	Иначе
		ДоговорДляПроводок = Договор;
	КонецЕсли;
	
	ТипЗадолженности = Справочники.ВидыЗадолженности.ОпределитьТипЗадолженности(ВидЗадолженности);
	
	Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАренде Тогда
		СчетУчетаУслуг = ПланыСчетов.Основной.РасчетыСПокупателямиИЗаказчиками;
	ИначеЕсли ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАрендеПеременнаяЧасть Тогда
		СчетУчетаУслуг = ПланыСчетов.Основной.РасчетыСПокупателямиИЗаказчикамиПеременнаяЧасть;
	Иначе
		Если Валюта = Организация.ВалютаУчета Тогда 
			СчетУчетаУслуг = БухгалтерскийУчет.ОпределитьНастройкуУчетаКомиссии(
			Дата, 
			Организация, 
			СчетДоверительногоУправления,
			ВидЗадолженности,
			УчетныйРегистр,
			"СчетУчета");
		Иначе 
			СчетУчетаУслуг = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВВалюте;
		КонецЕсли;
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(СчетУчетаУслуг) Тогда	
		ЕстьСубконтоКонтрагенты        = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено);
		ЕстьСубконтоСделки             = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Сделка) <> Неопределено);
		ЕстьСубконтоДоговоры	       = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры) <> Неопределено);
		ЕстьСубконтоДоговорыДепо       = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыДепозитарногоОбслуживания) <> Неопределено);
		ЕстьСубконтоБрокерскиеДоговоры = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено);
		ЕстьСубконтоОснованиеРасчетов  = (СчетУчетаУслуг.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов) <> Неопределено);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках учета не определен счет учета по выбранному виду задолженности. Документ " + ДокументСсылка + " не проведен по виду учета " + УчетныйРегистр + "!", ДокументСсылка,,,Отказ);
		Возврат Движения;
	КонецЕсли; 
	
	ВключатьРасходыПоПокупкеВСтоимость = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		Дата, 
		Организация,
		СчетДоверительногоУправления,
		УчетныйРегистр,
		"ВключатьРасходыПоПокупкеВСтоимость");
		
	Если ВключатьРасходыПоПокупкеВСтоимость = Неопределено Тогда
		ВключатьРасходыПоПокупкеВСтоимость = Ложь;		
	КонецЕсли;
	
	СчетУчетаНДС = ?(ДанныеОснования.НДСПоОбщимРасходам, ПланыСчетов.Основной.НДСПоОбщимРасходам, ПланыСчетов.Основной.НДСПоПрямымРасходам);
	
	СчетДоходовРасходов = ПланыСчетов.Основной.ПрочиеРасходы;
	Если ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская Тогда
		Если ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАрендеПеременнаяЧасть
			Или ВидЗадолженности = Справочники.ВидыЗадолженности.ПоАренде Тогда
			СчетДоходовРасходов = ПланыСчетов.Основной.Выручка;
		Иначе
			СчетДоходовРасходов = ПланыСчетов.Основной.ПрочиеДоходы;
		КонецЕсли;
	КонецЕсли;					
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Документы.КорректировкаЗадолженности.ПодготовитьДанныеПроведения(ДокументСсылка, Запрос, ТипЗадолженности, ДанныеОснования, ВестиУчетНДС);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоДокументу.ОснованиеДо КАК ОснованиеДо,
		|	_ПоДокументу.ОснованиеПосле КАК ОснованиеПосле,
		|	_ПоДокументу.ДатаОплатыДо КАК ДатаОплатыДо,
		|	_ПоДокументу.ДатаОплатыПосле КАК ДатаОплатыПосле,
		|	_ПоДокументу.СуммаДо КАК СуммаДо,
		|	_ПоДокументу.СуммаПосле КАК СуммаПосле,
		|	_ПоДокументу.СтавкаНДСДо КАК СтавкаНДСДо,
		|	_ПоДокументу.СтавкаНДСПосле КАК СтавкаНДСПосле,
		|	_ПоДокументу.СуммаНДСДо КАК СуммаНДСДо,
		|	_ПоДокументу.СуммаНДСПосле КАК СуммаНДСПосле,
		|	_ПоДокументу.ЭтоУвеличение КАК ЭтоУвеличение,
		|	_ПоДокументу.ЦеннаяБумагаДо КАК ЦеннаяБумагаДо,
		|	_ПоДокументу.ЦеннаяБумагаПосле КАК ЦеннаяБумагаПосле
		|ИЗ
		|	_ПоДокументу КАК _ПоДокументу";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ФормироватьНачисление = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыПроверкиНачисления = новый Структура("Дата, МетодОпределенияДоходовИРасходов, ЭтоПроведениеНачисления, Основание, "
			+ "ВидЗадолженности, ВидДоговораДоверительногоУправления, ВключатьРасходыПоПокупкеВСтоимость",
			ДокументСсылка.Дата,
			МетодОпределенияДоходовИРасходов,
			ЭтоПроведениеНачисления, 
			Выборка.ОснованиеДо,
			ВидЗадолженности,
			СчетДоверительногоУправления.ВидДоговораДоверительногоУправления,
			ВключатьРасходыПоПокупкеВСтоимость);
			
		Если Не Документы.НачислениеЗадолженности.НеобходимоСформироватьПроводкиНачисленияЗадолженности(ПараметрыПроверкиНачисления) Тогда
			ФормироватьНачисление = Ложь;
			Продолжить;	
		КонецЕсли;	
		
		НомерОснования = 1;
		Пока НомерОснования <= 2 Цикл
			
			ДельтаНДС = 0;
			Если НомерОснования = 1 Тогда
				//по "основанию до"
				Дельта = ?(Выборка.ОснованиеДо = Выборка.ОснованиеПосле, Выборка.СуммаПосле - Выборка.СуммаДо, - Выборка.СуммаДо); 
				Если ВестиУчетНДС Тогда
					ДельтаНДС = ?(Выборка.ОснованиеДо = Выборка.ОснованиеПосле, Выборка.СуммаНДСПосле - Выборка.СуммаНДСДо, - Выборка.СуммаНДСДо);
				КонецЕсли;
				
				ЦеннаяБумагаТекущая = Выборка.ЦеннаяБумагаДо; 
				ОснованиеТекущее = Выборка.ОснованиеДо;
			Иначе
				//по "основанию после"
				Дельта = Выборка.СуммаПосле; 
				Если ВестиУчетНДС Тогда
					ДельтаНДС = Выборка.СуммаНДСПосле;
				КонецЕсли;
				
				ЦеннаяБумагаТекущая = Выборка.ЦеннаяБумагаПосле; 
				ОснованиеТекущее = Выборка.ОснованиеПосле;
			КонецЕсли;
			
			Если Дельта <> 0 ИЛИ ДельтаНДС <> 0 Тогда
				ДанныеАналитики = Новый Структура("Сделка, ВидЗадолженности", ОснованиеТекущее, ВидЗадолженности);

				Если ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская Тогда
					
					СуммаПроводки = Дельта - ДельтаНДС;
					Если СуммаПроводки < 0 И ОтражатьУменьшениеОбратнойПроводкой Тогда
						СторонаУслуг = "Дт";
						СторонаДоходовРасходов = "Кт";
						СуммаПроводки = - СуммаПроводки;
					Иначе
						СторонаУслуг = "Кт";
						СторонаДоходовРасходов = "Дт";
					КонецЕсли;
						
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаПроводки, "Корректировка суммы услуг", ДанныеАналитики);
					
					Если СторонаДоходовРасходов = "Кт" тогда
						Проводка["Счет" + СторонаДоходовРасходов] = ПланыСчетов.Основной.ПрочиеДоходы;
					Иначе
						Проводка["Счет" + СторонаДоходовРасходов] = СчетДоходовРасходов;
					КонецЕсли;
					
					Проводка["Субконто" + СторонаДоходовРасходов].ПрочиеДоходыИРасходы = ПрочиеДоходыИРасходы;
					Если ЦеннаяБумагаТекущая <> Неопределено
						И Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип.СодержитТип(ТипЗнч(ЦеннаяБумагаТекущая)) Тогда
						
						Если УчетныйРегистр = "НалоговыйУчет" Тогда
							//#техдолг. оставлю это здесь 
							//нужна доработка функции БухгалтерскийУчет.ПолучитьСведенияОбОбращенииКорзиныЦенныхБумагНаОРЦБ для бумаг из неодноименных колонок (__До и ___После).
							//может не потребоваться, если будут корректировки по комиссиям, связанным с бумагами. 
							//+ возможно, обращаемость будет нужна на дату первичного документа, а не на дату кооректировки
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не поддерживаются корректировки в привязке к ценным бумагам. Необходимо заполнить признак обращаемости. Обратитесь к программистам для доработки обращаемости",,,,Отказ);
						Иначе
							Проводка["Субконто" + СторонаДоходовРасходов].ЦенныеБумаги         = ЦеннаяБумагаТекущая;
						КонецЕсли;
						
					ИначеЕсли ВидЗадолженности.Родитель = Справочники.ВидыЗадолженности.Недвижимость Тогда
						Проводка["Субконто" + СторонаДоходовРасходов].ЦенныеБумаги         = Договор;
					КонецЕсли;
								
					Проводка["Счет" + СторонаУслуг] = СчетУчетаУслуг;
					
					Если ЕстьСубконтоКонтрагенты Тогда
						Проводка["Субконто" + СторонаУслуг].Контрагенты = Контрагент;
					КонецЕсли;
					
					Если ЕстьСубконтоДоговоры Тогда
						Проводка["Субконто" + СторонаУслуг].Договоры = ДоговорДляПроводок;
					КонецЕсли;
					
					Если ДельтаНДС <> 0 Тогда 
						
						Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ДельтаНДС, "Корректировка входного НДС", ДанныеАналитики);

						Проводка.СчетДт = СчетУчетаНДС;
						Проводка.СубконтоДт.Контрагенты = Контрагент;
						Проводка.СубконтоДт.СчетаФактуры = ДокументСсылка;
									
						Проводка.СчетКт = СчетУчетаУслуг;
						
						Если ЕстьСубконтоКонтрагенты Тогда
							Проводка.СубконтоКт.Контрагенты = Контрагент;
						КонецЕсли;
						
						Если ЕстьСубконтоДоговоры Тогда
							Проводка.СубконтоКт.Договоры = ДоговорДляПроводок;
						КонецЕсли;
						
						Если ДанныеОснования.НДСВключатьВСтоимость Тогда
							
							Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ДельтаНДС, "НДС отнесен на расходы", ДанныеАналитики);
						
							Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
							Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ПрочиеДоходыИРасходы;
							Проводка.СубконтоДт.ЦенныеБумаги         = Неопределено;
							
							Проводка.СчетКт = СчетУчетаНДС;
							Проводка.СубконтоКт.Контрагенты = Контрагент;
							Проводка.СубконтоКт.СчетаФактуры = ДокументСсылка;
							
						ИначеЕсли ДанныеОснования.ЗачестьНДС Тогда
							
							Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ДельтаНДС, "Зачтен НДС", ДанныеАналитики);
						
							Проводка.СчетДт = ПланыСчетов.Основной.НДС;
							Проводка.СубконтоДт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
							
							Проводка.СчетКт = СчетУчетаНДС;
							Проводка.СубконтоКт.Контрагенты = Контрагент;
							Проводка.СубконтоКт.СчетаФактуры = ДокументСсылка;
							
						КонецЕсли;
						
						
					КонецЕсли;
					
				ИначеЕсли ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская Тогда
					
					СуммаПроводки = Дельта;
					Если СуммаПроводки < 0 И ОтражатьУменьшениеОбратнойПроводкой И СчетДоходовРасходов <> ПланыСчетов.Основной.Выручка Тогда
						СторонаУслуг = "Кт";
						СторонаДоходовРасходов = "Дт";
						СуммаПроводки = - СуммаПроводки;
					Иначе
						СторонаУслуг = "Дт";
						СторонаДоходовРасходов = "Кт";
					КонецЕсли;
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Дельта, "Корректировка выручки");

					Проводка["Счет" + СторонаУслуг] = СчетУчетаУслуг;
					
					Если ЕстьСубконтоКонтрагенты Тогда
						Проводка["Субконто" + СторонаУслуг].Контрагенты = Контрагент;
					КонецЕсли;
					
					Если ЕстьСубконтоДоговоры Тогда
						Проводка["Субконто" + СторонаУслуг].Договоры = ДоговорДляПроводок;
					КонецЕсли;
					
					Если СторонаДоходовРасходов = "Дт" Тогда
						Проводка["Счет" + СторонаДоходовРасходов] = ПланыСчетов.Основной.ПрочиеРасходы;
					Иначе
						Проводка["Счет" + СторонаДоходовРасходов] = СчетДоходовРасходов;
					КонецЕсли;
					
					Проводка["Субконто" + СторонаДоходовРасходов].ПрочиеДоходыИРасходы = ПрочиеДоходыИРасходы;
					Если ЦеннаяБумагаТекущая <> Неопределено
						И Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип.СодержитТип(ТипЗнч(ЦеннаяБумагаТекущая)) Тогда
						
						Если УчетныйРегистр = "НалоговыйУчет" Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не поддерживаются корректировки в привязке к ценным бумагам. Необходимо заполнить признак обращаемости. Обратитесь к программистам для доработки обращаемости",,,,Отказ);
						Иначе
							Проводка["Субконто" + СторонаДоходовРасходов].ЦенныеБумаги         = ЦеннаяБумагаТекущая;
						КонецЕсли;
						
					ИначеЕсли ВидЗадолженности.Родитель = Справочники.ВидыЗадолженности.Недвижимость Тогда
						Проводка["Субконто" + СторонаДоходовРасходов].ЦенныеБумаги         = Договор;
					КонецЕсли;
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализована корректировка по указанной операции", ДокументСсылка,,,Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
			Если Выборка.ОснованиеДо = Выборка.ОснованиеПосле Тогда
				Прервать;
			Иначе
				НомерОснования = НомерОснования + 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	
	
	Если ФормироватьНачисление Тогда
		
		Если ВестиУчетНДС Тогда
			//
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	&Валюта КАК Валюта,
				|	&ИФНС КАК ИФНС,
				|	_ИзменениеНДС.СтавкаНДС КАК СтавкаНДС,
				|	_ИзменениеНДС.ДельтаСуммаНДС КАК ИзменениеСуммыНДС
				|ИЗ
				|	_ИзменениеНДС КАК _ИзменениеНДС
				|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЗадолженностиНДС КАК _ОстаткиЗадолженностиНДС
				|		ПО _ИзменениеНДС.ОснованиеДо = _ОстаткиЗадолженностиНДС.Основание
				|			И (_ОстаткиЗадолженностиНДС.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоПриобретеннымЦенностям))
				|ГДЕ
				|	_ОстаткиЗадолженностиНДС.Основание ЕСТЬ NULL
				|	И &ВестиУчетНДС";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская Тогда
					
					Если ВыборкаДетальныеЗаписи.ИзменениеСуммыНДС > 0 Тогда
						
						Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.ИзменениеСуммыНДС,"Предъявление к вычету входного НДС в связи с увеличением стоимости ТРУ");
					
						Проводка.СчетДт = ПланыСчетов.Основной.НДС;
						Проводка.СубконтоДт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
						
						Проводка.СчетКт = СчетУчетаНДС;
						Проводка.СубконтоКт.Контрагенты = Контрагент;
						Проводка.СубконтоКт.СчетаФактуры = ДокументСсылка;
					Иначе
						Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, - ВыборкаДетальныеЗаписи.ИзменениеСуммыНДС,"Восстановление НДС по приобретенным ТРУ");
					
						Проводка.СчетДт = СчетУчетаНДС;
						Проводка.СубконтоДт.Контрагенты = Контрагент;
						Проводка.СубконтоДт.СчетаФактуры = ДокументСсылка;
						
						Проводка.СчетКт = ПланыСчетов.Основной.НДС;
						Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
						
					КонецЕсли;
					
				Иначе
					
											
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.ИзменениеСуммыНДС,"Учет суммы НДС с корректировки выручки");
				
					Проводка.СчетДт = ПланыСчетов.Основной.ПродажиНДС;
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ПрочиеДоходыИРасходы;
					Проводка.СубконтоДт.СтавкиНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
					
					Если ВыборкаДетальныеЗаписи.ИзменениеСуммыНДС > 0 Тогда

						Проводка.СчетКт = ПланыСчетов.Основной.НДС;
						Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
					Иначе
						Проводка.СчетКт = ПланыСчетов.Основной.НДСПоУменьшениюСтоимостиРеализации;
						Проводка.СубконтоКт.Контрагенты = Контрагент;
						Проводка.СубконтоКт.СчетаФактуры = ДокументСсылка;
						
						Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, -ВыборкаДетальныеЗаписи.ИзменениеСуммыНДС,"Вычет НДС при уменьшении стоимости отгруженных товаров");
						
						Проводка.СчетДт = ПланыСчетов.Основной.НДС;
						Проводка.СубконтоДт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
						
						Проводка.СчетКт = ПланыСчетов.Основной.НДСПоУменьшениюСтоимостиРеализации;
						Проводка.СубконтоКт.Контрагенты = Контрагент;
						Проводка.СубконтоКт.СчетаФактуры = ДокументСсылка;
					КонецЕсли;
						
				КонецЕсли;
				
			КонецЦикла;
				
		КонецЕсли;
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ВозникновениеАвансов.ОснованиеДо КАК ОснованиеДо,
			|	_ВозникновениеАвансов.Сумма КАК Сумма
			|ИЗ
			|	_ВозникновениеАвансов КАК _ВозникновениеАвансов";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.Сумма, "Учет образовавшейся предоплаты");
			
			Если ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская Тогда
				
				Проводка.СчетДт = ПланыСчетов.Основной.РасчетыПоАвансамВыданным;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.Договоры    = ДоговорДляПроводок;
				
				Проводка.СчетКт = СчетУчетаУслуг;
				
				Если ЕстьСубконтоКонтрагенты Тогда
					Проводка.СубконтоКт.Контрагенты = Контрагент;
				КонецЕсли;
				
				Если ЕстьСубконтоДоговоры Тогда
					Проводка.СубконтоКт.Договоры = ДоговорДляПроводок;
				КонецЕсли;
				
			Иначе
				
				Проводка.СчетДт = СчетУчетаУслуг;
				
				Если ЕстьСубконтоКонтрагенты Тогда
					Проводка.СубконтоДт.Контрагенты = Контрагент;
				КонецЕсли;
				
				Если ЕстьСубконтоДоговоры Тогда
					Проводка.СубконтоДт.Договоры = ДоговорДляПроводок;
				КонецЕсли;
				
				Проводка.СчетКт = ПланыСчетов.Основной.РасчетыСПокупателямиИЗаказчикамиАвансыПолученные;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				Проводка.СубконтоКт.Договоры    = ДоговорДляПроводок;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//зачеты авансов
		ТаблицаЗачетов = ПодготовитьТаблицуЗачетаАвансов(Запрос);
		
		Для Каждого СтрокаЗачета из ТаблицаЗачетов Цикл
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СтрокаЗачета.Сумма, "Зачет задолженности");
			
			Если ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская Тогда
				
				Проводка.СчетДт = СчетУчетаУслуг;
				
				Если ЕстьСубконтоКонтрагенты Тогда
					Проводка.СубконтоДт.Контрагенты = Контрагент;
				КонецЕсли;
				
				Если ЕстьСубконтоДоговоры Тогда
					Проводка.СубконтоДт.Договоры = ДоговорДляПроводок;
				КонецЕсли;
				
				Проводка.СчетКт = ПланыСчетов.Основной.РасчетыПоАвансамВыданным;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				Проводка.СубконтоКт.Договоры    = ДоговорДляПроводок;
				
				Если ЗначениеЗаполнено(СтрокаЗачета.ДокументАвансовыйСчетФактура) Тогда
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СтрокаЗачета.СуммаНДС, "НДС по авансу");
					
					Проводка.СчетДт = ПланыСчетов.Основной.НДСПоАвансамВыданным;
					Проводка.СубконтоДт.Контрагенты = Контрагент;
					Проводка.СубконтоДт.СчетаФактуры = СтрокаЗачета.ДокументАвансовыйСчетФактура;
					
					Проводка.СчетКт = ПланыСчетов.Основной.НДС;
					Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
					
				КонецЕсли;
				
			Иначе
				
				Проводка.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателямиИЗаказчикамиАвансыПолученные;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.Договоры    = ДоговорДляПроводок;
				
				Проводка.СчетКт = СчетУчетаУслуг;
				
				Если ЕстьСубконтоКонтрагенты Тогда
					Проводка.СубконтоКт.Контрагенты = Контрагент;
				КонецЕсли;
				
				Если ЕстьСубконтоДоговоры Тогда
					Проводка.СубконтоКт.Договоры = ДоговорДляПроводок;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаЗачета.ДокументАвансовыйСчетФактура) Тогда
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СтрокаЗачета.СуммаНДС, "НДС по авансу");
					
					Проводка.СчетДт = ПланыСчетов.Основной.НДС;
					Проводка.СубконтоДт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
					
					Проводка.СчетКт = ПланыСчетов.Основной.НДСПоАвансамПолученным;
					Проводка.СубконтоКт.Контрагенты = Контрагент;
					Проводка.СубконтоКт.СчетаФактуры = СтрокаЗачета.ДокументАвансовыйСчетФактура;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Движения;
	
КонецФункции
